{
  "DH": "Destination Address High. Set\/Get the upper 32 bits of the 64-bit destination address.\nWhen combined with DL, it defines the 64-bit destination address for data transmission.\nSpecial definitions for DH and DL include 0x000000000000FFFF (broadcast) and 0x0000000000000000 (coordinator).",
  "DL": "Destination Address Low. Set/Get the lower 32 bits of the 64-bit destination address.\nWhen combined with DH, it defines the 64-bit destination address for data transmissions.\nSpecial definitions for DH and DL include 0x000000000000FFFF(broadcast) and 0x0000000000000000 (coordinator).",
  "MY": "16-bit Network Address. Read the 16-bit network address of the module.\nA value of 0xFFFE means the module has not joined a ZigBee network.",
  "MP": "16-bit Parent Network Address. Считывает 16-битный родительский сетевой адрес модуля.",
  "SH": "Serial Number High. Считывает верхние 32 бита уникального IEEE 64-битного адреса RF-модуля.",
  "SL": "Serial Number Low. Считывает нижние 32 бита уникального IEEE 64-битного адреса RF-модуля.",
  "NI": "Node Identifier. Сохраняет строковый идентификатор. Разрешены только печатные символы ASCII",
  "SE": "Source Endpoint. Устанавливает/считывает значение исходного терминала уровня приложения ZigBee",
  "DE": "Destination Endpoint. Устанавливает/считывает значение терминала назначения ZigBee",
  "CI": "Cluster Identifier. Устанавливает/считывает значение идентификатора кластера Zigbee.",
  "DD": "Device type identifier. Сохраняет значение типа устройства. Это значение используется для отличия продуктов, основанных на XBee.",
  "DA": "Force Disassociation. Конечное устройство немедленно отменит связь с Координатор",
  "CH": "Operating Channel. Считывает номер канала, используемый для передачи и получения данных между RF-модулями.",
  "ID": "Extended PAN ID. Устанавливает/считывает идентификатор сети PAN, Personal Area Network.",
  "OP": "Operating extended PAN ID. Считывает 64-битный PAN ID",
  "NH": "Maximum Unicast Hops. Устанавливает/считывает максимальный лимит скачков, это ограничение устанавливает максимальное значение широковещательной передачи (BH) и определяет таймаут одноадресной передачи.",
  "BH": "Broadcast Hops. Устанавливает/считывает максимальное количество “скачков” для каждой широковещательной передачи. Значение 0 соответствует максимальному количеству скачков.",
  "OI": "Operating 16-bit PAN ID. Считывает 16-битный PAN ID",
  "NT": "Node Discovery Timeout. Устанавливает/считывает время, которое потратит узел при поиске других узлов (после команд ND или DN).",
  "ND": "Node Discover. Собирает информацию обо всех найденных RF-модулях.",
  "DN": "Destination Node. Устанавливает соответствие строки NI физическому адресу (команда чувствительна к регистру), Ответ будет получен в следующей форме: 16-битный сетевой и 64-битный расширенный адреса будут возвращены в API фрейме командного ответа.",
  "SC": "Scan Channels. Устанавливает/считывает список каналов для сканирования.",
  "SD": "Scan Duration. Устанавливает/считывает экспоненту времени сканирования. Изменения в SD должны быть сохранены с помощью команды WR.",
  "NJ": "Node Join Time. Устанавливает/считывает время, в течение которого Координатор/Маршрутизатор разрешает узлу присоединиться.",
  "JV": "Channel Verification. Устанавливает/считывает параметр проверки канала. Если JV = 1, маршрутизатор будет проверять координатор на своем рабочем канале при подключении или выходе из цикла питания. Если координатор не обнаружен, маршрутизатор покинет свой текущий канал и попытается присоединиться к новому PAN. Если JV = 0, маршрутизатор будет продолжать работать на своем текущем канале, даже если координатор не обнаружен.",
  "NW": "Network Watchdog Timeout. Считывает/устанавливает таймаут контроля сети, если NW>0 то роутер будет мониторить соединенике с координатором и покинет сеть если не соединится с координатором в течение NW=3 периодов",
  "JN": "Join Notification. Устанавливает/считывает значение идентификации присоединения. Если параметр активирован, после присоединения к сети устройство отправит Координатору сообщение о присоединении.",
  "AR": "Aggregate Routing Notification. Устанавливает/считывает время между последовательными агрегированными широковещательными сообщениями о маршрутизации. При использовании этот параметр должен быть установлен только на одном устройстве, чтобы разрешить маршрутизацию устройства “многими к одному”. Если AR = 0 используется только одна широковещательная передача.",
  "EE": "Encryption Enable. Включить шифрование.",
  "EO": "Encryption Options. Параметры шифрования, опции: 0x01-отправка ключа безопасности по воздуху(незащищено) 0x02-использовать доверительный центр.",
  "NK": "Network Encryption Key. Устанавливает 128 битное AES шифрование, Эта команда предназначена только для записи; NK не может быть прочитан. Если установлено значение 0 (по умолчанию), модуль выберет случайный сетевой ключ.",
  "KY": "Link Key.  Установите 128-битный ключ шифрования. Эта команда предназначена только для записи; KY не читается. Установка KY в 0 приведет к тому, что координатор передаст сетевой ключ в чистом виде соединительным устройствам и заставит присоединяющиеся устройства приобретать сетевой ключ в чистом виде.",
  "PL": "Power Level. Устанавливает/считывает уровень мощности, с которым RF-модуль осуществляет передачу, значение параметров: 0 = -8 dBm 1 = -4 dBm 2 = -2 dBm 3 = 0 dBm 4 = +2 dBm.",
  "PM": "Power Mode. Устанавливает/считывает настройки подъема мощности. Активация режима подъема улучшит чувствительность приема на 1dB и мощность передачи на 2dB.",
  "DB": "Received Signal Strength. Сообщает о мощности сигнала последнего принятого пакета, Значение команды DB измеряется в -dBm.",
  "PP": "Peak Power. Считывает максимальную выходную мощность в dBm.",
  "AP": "API Enable. Активирует режим API, 1 = API-enabled 2 = API-enabled(с управляющими Escape символами)",
  "AO": "API Options. Настраивает API режим. Выбор типа API фрейма приема для отправки из UART после получения пакетов RF-данных. 0 – Активированы индикаторы приема API по умолчанию 1 – Активирован API фрейм индикатора прямого приема (0x91).",
  "BD": "Interface Data Rate. Устанавливает/считывает скорость обмена данными между последовательным портом модуля и хост-приложением.0 = 1200 бит/сек 1 = 2400 2 = 4800 3 = 9600 4 = 19200 5 = 38400 6 = 57600 7 = 115200",
  "NB": "Serial Parity. Устанавливает/считывает serial parity на модуле.0 = No parity 1 = Even parity 2 = Odd parity 3 = Mark parity.",
  "RO": "Packetization Timeout. Устанавливает/считывает число задержек символа, после которых будет сформирован пакет. Значение (RO=0) приведет к передаче символов по мере их получения вместо буферизации в RF-пакете.",
  "VR": "Firmware Version. Считывает версию программного обеспечения модуля.",
  "HV": "Hardware Version. Считывает версию аппаратного обеспечения модуля.",
  "AI": "Association Indication. Считывает информацию о последнем запросе на присоединение к узлу, 0x00 - Successfully formed or joined a network. (Coordinators form a network, routers and end devices join a network.)0x21 - Scan found no PANs, 0x22 - Scan found no valid PANs based on current SC and ID settings, 0x23 - Valid Coordinator or Routers found, but they are not allowing joining (NJ expired), 0x24 - No joinable beacons were found, 0x25 - Unexpected state, node should not be attempting to join at this time, 0x27 - Node Joining attempt failed (typically due to incompatible security settings), 0x2A - Coordinator Start attempt failed, 0x2B - Checking for an existing coordinator, 0x2C - Attempt to leave the network failed, 0xAB - Attempted to join a device that did not respond, 0xAC - Secure join error - network security key received unsecured, 0xAD - Secure join error - network security key not received, 0xAF - Secure join error - joining device does not have the right preconfigured link key, 0xFF - Scanning for a ZigBee network (routers and end devices).",
  "SM": "Sleep Mode. Настраивает спящий режим в RF-модуле.0-Спящий режим отключен, 1-Активирован вывод сна 4-Активирован сон в цикле, Замечание: Если SM=0, устройство функционирует как Маршрутизатор. При смене SM на не нулевое значение, Маршрутизатор отключается от сети и подключается как Конечное устройство. Режим сна возможен только для Конечных устройств.",
  "SN": "Number of Sleep Periods. Устанавливает количество периодов сна, при которых вывод On/Sleep не будет сигнализировать о пробуждении, если для Конечного устройства нет данных, ожидающих получения. Эта команда позволяет хост-приложению спать длительное время, при условии, что RF-данные отсутствуют.",
  "SP": "Sleep Period. Это значение определяет, как долго Конечное устройство будет находиться в состоянии сна за один период, максимально до 28 секунд. (Период сна может быть увеличен более 28 секунд с помощью команды SN). На родительском устройстве, это значение определяет, как долго родительское устройство будет буферизировать сообщения для спящего Конечного устройства. Это значение должно быть больше или равно самому длительному из периодов SP на любом из дочерних Конечных устройств.",
  "ST": "Time Before Sleep. Устанавливает период времени до начала режима сна. Это значение переустанавливается после получения последовательных или RF данных. После истечения этого времени Конечное устройство переходит в режим низкого потребления. Используется во время сна в цикле и только для Конечных устройств.",
  "PO": "Polling Rate. Устанавливает/считывает частоту опроса конечного устройства.",
  "AC": "Apply Changes. Применяет изменения во всех командных регистрах, в результате чего применяются значения регистровой команды в очереди. Например, изменение скорости последовательного интерфейса с помощью команды BD не изменит скорость интерфейса UART до тех пор, пока изменения не будут применены командой AC.",
  "WR": "Write. Записывает значения параметров в постоянную память для сохранения значений после последующей перезагрузки",
  "RE": "Restore Defaults. Восстанавливает параметры модуля на значения по умолчанию. Команда RE не восстанавливает параметр ID.",
  "FR": "Software Reset. Перезапуск ПО модуля.",
  "NR": "Network Reset. Перезапускает параметры сети на одном или более модулях. Ответ “OK” отправляется немедленно, затем выполняется перезапуск сети. Все сетевые настройки и информация о маршрутизации будут утеряны.Если NR = 0: Переустанавливает параметры сети на узле, вызвавшем команду.Если NR = 1:Отправляет широковещательную передачу для перезапуска параметров на всех узлах сети.",
  "SI": "Sleep Immediately. Вызывайте циклический модуль сна для немедленного сна, а не до тех пор, пока не истечет таймер ST."
}